## Review pandas DataFrames

In [4]:
import pandas as pd

aapl = pd.read_csv('aapl.csv', 
                   parse_dates=True, 
                   index_col='Date')

In [5]:
aapl

              Open    High     Low   Close    Volume  Adj Close
Date
2014-09-16   99.80  101.26   98.89  100.86  66818200     100.86
2014-09-15  102.81  103.05  101.44  101.63  61216500     101.63
2014-09-12  101.21  102.19  101.08  101.66  62626100     101.66

In [6]:
type(aapl)

pandas.core.frame.DataFrame

In [7]:
aapl.shape

(3, 6)

In [8]:
aapl.columns

Index(['Open', 'High', 'Low', 'Close', 'Volume', 'Adj Close'], dtype='object')

In [9]:
type(aapl.columns)

pandas.core.indexes.base.Index

In [10]:
aapl.index

DatetimeIndex(['2014-09-16', '2014-09-15', '2014-09-12'], dtype='datetime64[ns]', name='Date', freq=None)

In [11]:
type(aapl.index)

pandas.core.indexes.datetimes.DatetimeIndex

In [12]:
aapl.iloc[:3,:]

              Open    High     Low   Close    Volume  Adj Close
Date
2014-09-16   99.80  101.26   98.89  100.86  66818200     100.86
2014-09-15  102.81  103.05  101.44  101.63  61216500     101.63
2014-09-12  101.21  102.19  101.08  101.66  62626100     101.66

In [19]:
aapl.iloc[-2:,:]

              Open    High     Low   Close    Volume  Adj Close
Date
2014-09-15  102.81  103.05  101.44  101.63  61216500     101.63
2014-09-12  101.21  102.19  101.08  101.66  62626100     101.66

In [31]:
aapl.loc[:,'Open':'Adj Close':2]

              Open     Low    Volume
Date
2014-09-16   99.80   98.89  66818200
2014-09-15  102.81  101.44  61216500
2014-09-12  101.21  101.08  62626100

In [29]:
aapl.loc[:,['Open','High','Close']]

              Open    High   Close
Date
2014-09-16   99.80  101.26  100.86
2014-09-15  102.81  103.05  101.63
2014-09-12  101.21  102.19  101.66

In [32]:
aapl.head(1)

            Open    High    Low   Close    Volume  Adj Close
Date
2014-09-16  99.8  101.26  98.89  100.86  66818200     100.86

In [33]:
aapl.head(2)

              Open    High     Low   Close    Volume  Adj Close
Date
2014-09-16   99.80  101.26   98.89  100.86  66818200     100.86
2014-09-15  102.81  103.05  101.44  101.63  61216500     101.63

In [34]:
aapl.tail(1)

              Open    High     Low   Close    Volume  Adj Close
Date
2014-09-12  101.21  102.19  101.08  101.66  62626100     101.66

In [35]:
aapl.tail(3)

              Open    High     Low   Close    Volume  Adj Close
Date
2014-09-16   99.80  101.26   98.89  100.86  66818200     100.86
2014-09-15  102.81  103.05  101.44  101.63  61216500     101.63
2014-09-12  101.21  102.19  101.08  101.66  62626100     101.66

In [36]:
aapl.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 3 entries, 2014-09-16 to 2014-09-12
Data columns (total 6 columns):
Open         3 non-null float64
High         3 non-null float64
Low          3 non-null float64
Close        3 non-null float64
Volume       3 non-null int64
Adj Close    3 non-null float64
dtypes: float64(5), int64(1)
memory usage: 168.0 bytes

## Broadcasting

In [37]:
import numpy as np

In [38]:
# assigning scalar value to column slice 
# broadcasts value to each row

aapl.iloc[::3, -1] = np.nan

In [39]:
aapl

              Open    High     Low   Close    Volume  Adj Close
Date
2014-09-16   99.80  101.26   98.89  100.86  66818200        NaN
2014-09-15  102.81  103.05  101.44  101.63  61216500     101.63
2014-09-12  101.21  102.19  101.08  101.66  62626100     101.66

In [40]:
aapl.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 3 entries, 2014-09-16 to 2014-09-12
Data columns (total 6 columns):
Open         3 non-null float64
High         3 non-null float64
Low          3 non-null float64
Close        3 non-null float64
Volume       3 non-null int64
Adj Close    2 non-null float64
dtypes: float64(5), int64(1)
memory usage: 168.0 bytes

In [41]:
low = aapl['Low']

In [42]:
type(low)

pandas.core.series.Series

In [43]:
low.head()

Date
2014-09-16     98.89
2014-09-15    101.44
2014-09-12    101.08
Name: Low, dtype: float64

In [44]:
lows = low.values

In [45]:
type(lows)

numpy.ndarray

# Building DataFrames from Scratch

In [46]:
import pandas as pd

In [50]:
data = {'weekday': ['Sun','Sun','Mon','Mon'],
       'city': ['Austin', 'Dallas', 'Austin', 'Dallas'],
       'visitors': [139, 237, 326, 456],
       'signups': [7, 12, 3, 5]}
#why was it sorted?
data

{'city': ['Austin', 'Dallas', 'Austin', 'Dallas'],
 'signups': [7, 12, 3, 5],
 'visitors': [139, 237, 326, 456],
 'weekday': ['Sun', 'Sun', 'Mon', 'Mon']}

In [48]:
users = pd.DataFrame(data)

In [49]:
users

     city  signups  visitors weekday
0  Austin        7       139     Sun
1  Dallas       12       237     Sun
2  Austin        3       326     Mon
3  Dallas        5       456     Mon

#### More

In [51]:
import pandas as pd

In [52]:
cities = ['Austin', 'Dallas', 'Austin', 'Dallas']

In [53]:
signups = [7, 12, 3, 5]

In [54]:
visitors = [139, 237, 326, 456]

In [55]:
weekdays = ['Sun', 'Sun', 'Mon', 'Mon']

In [56]:
list_labels = ['city', 'signups', 'visitors', 'weekday']

In [57]:
list_cols = [cities, signups, visitors, weekdays]

In [58]:
zipped = list(zip(list_labels, list_cols))

In [59]:
zipped

[('city', ['Austin', 'Dallas', 'Austin', 'Dallas']),
 ('signups', [7, 12, 3, 5]),
 ('visitors', [139, 237, 326, 456]),
 ('weekday', ['Sun', 'Sun', 'Mon', 'Mon'])]

In [62]:
type(zipped)

list

In [63]:
data = dict(zipped)

In [64]:
data

{'city': ['Austin', 'Dallas', 'Austin', 'Dallas'],
 'signups': [7, 12, 3, 5],
 'visitors': [139, 237, 326, 456],
 'weekday': ['Sun', 'Sun', 'Mon', 'Mon']}

In [65]:
users = pd.DataFrame(data)

In [66]:
users

     city  signups  visitors weekday
0  Austin        7       139     Sun
1  Dallas       12       237     Sun
2  Austin        3       326     Mon
3  Dallas        5       456     Mon

In [67]:
users['fees'] = 0

In [68]:
users

     city  signups  visitors weekday  fees
0  Austin        7       139     Sun     0
1  Dallas       12       237     Sun     0
2  Austin        3       326     Mon     0
3  Dallas        5       456     Mon     0

### Broadcasting with a dict

In [69]:
import pandas as pd

In [70]:
heights = [59.0, 65.2, 62.9, 65.4, 63.7, 65.7, 64.1]

In [74]:
data = {'sex': 'M', 'height': heights}

In [75]:
results = pd.DataFrame(data)

In [76]:
results

   height sex
0    59.0   M
1    65.2   M
2    62.9   M
3    65.4   M
4    63.7   M
5    65.7   M
6    64.1   M

In [77]:
results.columns = ['height (in)', 'sex']

In [79]:
results

   height (in) sex
0         59.0   M
1         65.2   M
2         62.9   M
3         65.4   M
4         63.7   M
5         65.7   M
6         64.1   M

In [80]:
results.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [81]:
results

   height (in) sex
A         59.0   M
B         65.2   M
C         62.9   M
D         65.4   M
E         63.7   M
F         65.7   M
G         64.1   M

# Importing and exporting data

In [82]:
import pandas as pd

In [85]:
filepath = 'ISSN_D_tot.csv'

In [86]:
sunspots = pd.read_csv(filepath)

In [87]:
sunspots.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 72103 entries, 0 to 72102
Data columns (total 6 columns):
1818        72103 non-null int64
01          72103 non-null int64
01.1        72103 non-null int64
1818.004    72103 non-null float64
 -1         72103 non-null int64
1           72103 non-null int64
dtypes: float64(1), int64(5)
memory usage: 3.3 MB

In [88]:
sunspots.head()

   1818  01  01.1  1818.004   -1  1
0  1818   1     2  1818.007   -1  1
1  1818   1     3  1818.010   -1  1
2  1818   1     4  1818.012   -1  1
3  1818   1     5  1818.015   -1  1
4  1818   1     6  1818.018   -1  1

In [89]:
sunspots.iloc[10:20, :]

    1818  01  01.1  1818.004   -1  1
10  1818   1    12  1818.034   -1  1
11  1818   1    13  1818.037   22  1
12  1818   1    14  1818.040   -1  1
13  1818   1    15  1818.042   -1  1
14  1818   1    16  1818.045   -1  1
15  1818   1    17  1818.048   46  1
16  1818   1    18  1818.051   59  1
17  1818   1    19  1818.053   63  1
18  1818   1    20  1818.056   -1  1
19  1818   1    21  1818.059   -1  1

### Problems
CSV file has no column headers

- Columns 0-2: Gregorian date (year, month, day)
- Column 3: Date as fraction as year
- Column 4: Daily total sunspot number
- Column 5: Definitive/provisional indicator (1 or O)

Missing values in column 4: indicated by -1

Dates representation inconvenient

#### Using header keyword

In [90]:
sunspots = pd.read_csv(filepath, header=None)

In [92]:
sunspots.iloc[10:20, :]

       0  1   2         3   4  5
10  1818  1  11  1818.031  -1  1
11  1818  1  12  1818.034  -1  1
12  1818  1  13  1818.037  22  1
13  1818  1  14  1818.040  -1  1
14  1818  1  15  1818.042  -1  1
15  1818  1  16  1818.045  -1  1
16  1818  1  17  1818.048  46  1
17  1818  1  18  1818.051  59  1
18  1818  1  19  1818.053  63  1
19  1818  1  20  1818.056  -1  1

In [93]:
col_names = ['year', 'month', 'day', 
             'dec_date', 'sunspots', 'definite']

In [94]:
sunspots = pd.read_csv(filepath, header=None,
                      names=col_names)

In [95]:
sunspots.iloc[10:20, :]

    year  month  day  dec_date  sunspots  definite
10  1818      1   11  1818.031        -1         1
11  1818      1   12  1818.034        -1         1
12  1818      1   13  1818.037        22         1
13  1818      1   14  1818.040        -1         1
14  1818      1   15  1818.042        -1         1
15  1818      1   16  1818.045        -1         1
16  1818      1   17  1818.048        46         1
17  1818      1   18  1818.051        59         1
18  1818      1   19  1818.053        63         1
19  1818      1   20  1818.056        -1         1

In [96]:
sunspots = pd.read_csv(filepath, header=None,
                      names=col_names, na_values=' -1')

In [97]:
sunspots.iloc[10:20, :]

    year  month  day  dec_date  sunspots  definite
10  1818      1   11  1818.031       NaN         1
11  1818      1   12  1818.034       NaN         1
12  1818      1   13  1818.037      22.0         1
13  1818      1   14  1818.040       NaN         1
14  1818      1   15  1818.042       NaN         1
15  1818      1   16  1818.045       NaN         1
16  1818      1   17  1818.048      46.0         1
17  1818      1   18  1818.051      59.0         1
18  1818      1   19  1818.053      63.0         1
19  1818      1   20  1818.056       NaN         1

In [98]:
#na value untuk kolom spesifik
sunspots = pd.read_csv(filepath, header=None,
                       names=col_names,
                       na_values={'sunspots':[' -1']})

In [99]:
sunspots.iloc[10:20, :]

    year  month  day  dec_date  sunspots  definite
10  1818      1   11  1818.031       NaN         1
11  1818      1   12  1818.034       NaN         1
12  1818      1   13  1818.037      22.0         1
13  1818      1   14  1818.040       NaN         1
14  1818      1   15  1818.042       NaN         1
15  1818      1   16  1818.045       NaN         1
16  1818      1   17  1818.048      46.0         1
17  1818      1   18  1818.051      59.0         1
18  1818      1   19  1818.053      63.0         1
19  1818      1   20  1818.056       NaN         1

#### Using parse_dates keyword

In [100]:
#na value untuk kolom spesifik
sunspots = pd.read_csv(filepath, header=None,
                       names=col_names,
                       na_values={'sunspots':[' -1']},
                       parse_dates=[[0, 1, 2]])

In [101]:
sunspots.iloc[10:20, :]

   year_month_day  dec_date  sunspots  definite
10     1818-01-11  1818.031       NaN         1
11     1818-01-12  1818.034       NaN         1
12     1818-01-13  1818.037      22.0         1
13     1818-01-14  1818.040       NaN         1
14     1818-01-15  1818.042       NaN         1
15     1818-01-16  1818.045       NaN         1
16     1818-01-17  1818.048      46.0         1
17     1818-01-18  1818.051      59.0         1
18     1818-01-19  1818.053      63.0         1
19     1818-01-20  1818.056       NaN         1

In [102]:
sunspots.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 72104 entries, 0 to 72103
Data columns (total 4 columns):
year_month_day    72104 non-null datetime64[ns]
dec_date          72104 non-null float64
sunspots          68857 non-null float64
definite          72104 non-null int64
dtypes: datetime64[ns](1), float64(2), int64(1)
memory usage: 2.2 MB

In [103]:
sunspots.index = sunspots['year_month_day']

In [104]:
sunspots.index.name = 'date'

In [108]:
sunspots.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 72104 entries, 1818-01-01 to 2015-05-31
Data columns (total 4 columns):
year_month_day    72104 non-null datetime64[ns]
dec_date          72104 non-null float64
sunspots          68857 non-null float64
definite          72104 non-null int64
dtypes: datetime64[ns](1), float64(2), int64(1)
memory usage: 2.8 MB

### Trimming redundant columns

In [109]:
cols = ['sunspots', 'definite']

In [110]:
sunspots = sunspots[cols]

In [111]:
sunspots.iloc[10:20, :]

            sunspots  definite
date
1818-01-11       NaN         1
1818-01-12       NaN         1
1818-01-13      22.0         1
1818-01-14       NaN         1
1818-01-15       NaN         1
1818-01-16       NaN         1
1818-01-17      46.0         1
1818-01-18      59.0         1
1818-01-19      63.0         1
1818-01-20       NaN         1

### Writing files

In [112]:
out_csv = 'sunspots.csv'

In [113]:
sunspots.to_csv(out_csv)

In [114]:
out_tsv = 'sunspots.tsv'

In [115]:
sunspots.to_csv(out_tsv, sep='\t')

In [116]:
out_xlsx = 'sunspots.xlsx'